Revit 2027 API
BuiltInFailures.EditingFailures.CannotEditRenamedWorkset Property
 Can't edit workset ' [Name] '.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotEditRenamedWorkset { get; }
Public Shared ReadOnly Property CannotEditRenamedWorkset As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotEditRenamedWorkset {
	FailureDefinitionId^ get ();
}
static member CannotEditRenamedWorkset : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace